
Create_clock -name dco_clk -period 1500 -waveform {0 750} [get ports dco_clk]
 set_clock_transition -rise -min 154 [get_clocks dco_clk]
 set_clock_transition -fall -min 155 [get_clocks dco_clk]
 set_clock_transition -rise -max 156 [get_clocks dco_clk]
 set_clock_transition -fall -max 157 [get_clocks dco_clk]
 set_clock_latency -source -early -rise 150 [get_clocks dco_clk]
 set_clock_latency -source -early -fall 151 [get_clocks dco_clk]
 set_clock_latency -source -late -rise 152 [get_clocks dco_clk]
 set_clock_latency -sorce -late -fall 153 [get_clocks dco_clk]
Create_clock -name lfxt_clk -period 1600 -waveform {0 960} [get ports lfxt_clk]
 set_clock_transition -rise -min 155 [get_clocks lfxt_clk]
 set_clock_transition -fall -min 156 [get_clocks lfxt_clk]
 set_clock_transition -rise -max 157 [get_clocks lfxt_clk]
 set_clock_transition -fall -max 158 [get_clocks lfxt_clk]
 set_clock_latency -source -early -rise 151 [get_clocks lfxt_clk]
 set_clock_latency -source -early -fall 152 [get_clocks lfxt_clk]
 set_clock_latency -source -late -rise 153 [get_clocks lfxt_clk]
 set_clock_latency -sorce -late -fall 154 [get_clocks lfxt_clk]
 set_input_delay -clock [get_clocks yet_to_decide1] -min -rise -source -latency_included 100[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide1] -min -fall -source -latency_included 101[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide1] -max -rise -source -latency_included 102[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide1] -max -fall  -source -latency_included 103[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide1] -in -rise -source -latency_included 100[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide1] -in -rise -source -latency_included 100[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide1] -in -rise -source -latency_included 100[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide1] -in -rise -source -latency_included 100[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide1] -in -rise -source -latency_included 100[get_ports cpu_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -min -rise -source -latency_included 101[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -min -fall -source -latency_included 102[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -max -rise -source -latency_included 103[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -max -fall  -source -latency_included 104[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -in -rise -source -latency_included 101[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -in -rise -source -latency_included 101[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -in -rise -source -latency_included 101[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -in -rise -source -latency_included 101[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide2] -in -rise -source -latency_included 101[get_ports dbg_en]
 set_input_delay -clock [get_clocks yet_to_decide3] -min -rise -source -latency_included 102[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide3] -min -fall -source -latency_included 103[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide3] -max -rise -source -latency_included 104[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide3] -max -fall  -source -latency_included 105[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide3] -in -rise -source -latency_included 102[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide3] -in -rise -source -latency_included 102[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide3] -in -rise -source -latency_included 102[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide3] -in -rise -source -latency_included 102[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide3] -in -rise -source -latency_included 102[get_ports dbg_i2c_addr]
 set_input_delay -clock [get_clocks yet_to_decide4] -min -rise -source -latency_included 103[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide4] -min -fall -source -latency_included 104[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide4] -max -rise -source -latency_included 105[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide4] -max -fall  -source -latency_included 106[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide4] -in -rise -source -latency_included 103[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide4] -in -rise -source -latency_included 103[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide4] -in -rise -source -latency_included 103[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide4] -in -rise -source -latency_included 103[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide4] -in -rise -source -latency_included 103[get_ports dbg_i2c_broadcast]
 set_input_delay -clock [get_clocks yet_to_decide5] -min -rise -source -latency_included 104[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide5] -min -fall -source -latency_included 105[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide5] -max -rise -source -latency_included 106[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide5] -max -fall  -source -latency_included 107[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide5] -in -rise -source -latency_included 104[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide5] -in -rise -source -latency_included 104[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide5] -in -rise -source -latency_included 104[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide5] -in -rise -source -latency_included 104[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide5] -in -rise -source -latency_included 104[get_ports dbg_i2c_scl]
 set_input_delay -clock [get_clocks yet_to_decide6] -min -rise -source -latency_included 105[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide6] -min -fall -source -latency_included 106[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide6] -max -rise -source -latency_included 107[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide6] -max -fall  -source -latency_included 108[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide6] -in -rise -source -latency_included 105[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide6] -in -rise -source -latency_included 105[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide6] -in -rise -source -latency_included 105[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide6] -in -rise -source -latency_included 105[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide6] -in -rise -source -latency_included 105[get_ports dbg_i2c_sda_in]
 set_input_delay -clock [get_clocks yet_to_decide7] -min -rise -source -latency_included 106[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide7] -min -fall -source -latency_included 107[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide7] -max -rise -source -latency_included 108[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide7] -max -fall  -source -latency_included 109[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide7] -in -rise -source -latency_included 106[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide7] -in -rise -source -latency_included 106[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide7] -in -rise -source -latency_included 106[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide7] -in -rise -source -latency_included 106[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide7] -in -rise -source -latency_included 106[get_ports dbg_uart_rxd]
 set_input_delay -clock [get_clocks yet_to_decide8] -min -rise -source -latency_included 108[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide8] -min -fall -source -latency_included 109[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide8] -max -rise -source -latency_included 110[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide8] -max -fall  -source -latency_included 111[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide8] -in -rise -source -latency_included 108[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide8] -in -rise -source -latency_included 108[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide8] -in -rise -source -latency_included 108[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide8] -in -rise -source -latency_included 108[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide8] -in -rise -source -latency_included 108[get_ports dmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide9] -min -rise -source -latency_included 109[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide9] -min -fall -source -latency_included 110[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide9] -max -rise -source -latency_included 111[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide9] -max -fall  -source -latency_included 112[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide9] -in -rise -source -latency_included 109[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide9] -in -rise -source -latency_included 109[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide9] -in -rise -source -latency_included 109[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide9] -in -rise -source -latency_included 109[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide9] -in -rise -source -latency_included 109[get_ports irq]
 set_input_delay -clock [get_clocks yet_to_decide10] -min -rise -source -latency_included 111[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide10] -min -fall -source -latency_included 112[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide10] -max -rise -source -latency_included 113[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide10] -max -fall  -source -latency_included 114[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide10] -in -rise -source -latency_included 111[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide10] -in -rise -source -latency_included 111[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide10] -in -rise -source -latency_included 111[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide10] -in -rise -source -latency_included 111[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide10] -in -rise -source -latency_included 111[get_ports dma_addr]
 set_input_delay -clock [get_clocks yet_to_decide11] -min -rise -source -latency_included 112[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide11] -min -fall -source -latency_included 113[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide11] -max -rise -source -latency_included 114[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide11] -max -fall  -source -latency_included 115[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide11] -in -rise -source -latency_included 112[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide11] -in -rise -source -latency_included 112[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide11] -in -rise -source -latency_included 112[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide11] -in -rise -source -latency_included 112[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide11] -in -rise -source -latency_included 112[get_ports dma_din]
 set_input_delay -clock [get_clocks yet_to_decide12] -min -rise -source -latency_included 113[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide12] -min -fall -source -latency_included 114[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide12] -max -rise -source -latency_included 115[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide12] -max -fall  -source -latency_included 116[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide12] -in -rise -source -latency_included 113[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide12] -in -rise -source -latency_included 113[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide12] -in -rise -source -latency_included 113[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide12] -in -rise -source -latency_included 113[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide12] -in -rise -source -latency_included 113[get_ports dma_en]
 set_input_delay -clock [get_clocks yet_to_decide13] -min -rise -source -latency_included 114[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide13] -min -fall -source -latency_included 115[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide13] -max -rise -source -latency_included 116[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide13] -max -fall  -source -latency_included 117[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide13] -in -rise -source -latency_included 114[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide13] -in -rise -source -latency_included 114[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide13] -in -rise -source -latency_included 114[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide13] -in -rise -source -latency_included 114[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide13] -in -rise -source -latency_included 114[get_ports dma_priority]
 set_input_delay -clock [get_clocks yet_to_decide14] -min -rise -source -latency_included 115[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide14] -min -fall -source -latency_included 116[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide14] -max -rise -source -latency_included 117[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide14] -max -fall  -source -latency_included 118[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide14] -in -rise -source -latency_included 115[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide14] -in -rise -source -latency_included 115[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide14] -in -rise -source -latency_included 115[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide14] -in -rise -source -latency_included 115[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide14] -in -rise -source -latency_included 115[get_ports dma_we]
 set_input_delay -clock [get_clocks yet_to_decide15] -min -rise -source -latency_included 116[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide15] -min -fall -source -latency_included 117[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide15] -max -rise -source -latency_included 118[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide15] -max -fall  -source -latency_included 119[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide15] -in -rise -source -latency_included 116[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide15] -in -rise -source -latency_included 116[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide15] -in -rise -source -latency_included 116[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide15] -in -rise -source -latency_included 116[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide15] -in -rise -source -latency_included 116[get_ports dma_wkup]
 set_input_delay -clock [get_clocks yet_to_decide16] -min -rise -source -latency_included 117[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide16] -min -fall -source -latency_included 118[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide16] -max -rise -source -latency_included 119[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide16] -max -fall  -source -latency_included 120[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide16] -in -rise -source -latency_included 117[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide16] -in -rise -source -latency_included 117[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide16] -in -rise -source -latency_included 117[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide16] -in -rise -source -latency_included 117[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide16] -in -rise -source -latency_included 117[get_ports nmi]
 set_input_delay -clock [get_clocks yet_to_decide17] -min -rise -source -latency_included 118[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide17] -min -fall -source -latency_included 119[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide17] -max -rise -source -latency_included 120[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide17] -max -fall  -source -latency_included 121[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide17] -in -rise -source -latency_included 118[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide17] -in -rise -source -latency_included 118[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide17] -in -rise -source -latency_included 118[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide17] -in -rise -source -latency_included 118[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide17] -in -rise -source -latency_included 118[get_ports per_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -min -rise -source -latency_included 119[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -min -fall -source -latency_included 120[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -max -rise -source -latency_included 121[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -max -fall  -source -latency_included 122[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -in -rise -source -latency_included 119[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -in -rise -source -latency_included 119[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -in -rise -source -latency_included 119[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -in -rise -source -latency_included 119[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide18] -in -rise -source -latency_included 119[get_ports pmem_dout]
 set_input_delay -clock [get_clocks yet_to_decide19] -min -rise -source -latency_included 120[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide19] -min -fall -source -latency_included 121[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide19] -max -rise -source -latency_included 122[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide19] -max -fall  -source -latency_included 123[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide19] -in -rise -source -latency_included 120[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide19] -in -rise -source -latency_included 120[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide19] -in -rise -source -latency_included 120[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide19] -in -rise -source -latency_included 120[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide19] -in -rise -source -latency_included 120[get_ports reset_n]
 set_input_delay -clock [get_clocks yet_to_decide20] -min -rise -source -latency_included 121[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide20] -min -fall -source -latency_included 122[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide20] -max -rise -source -latency_included 123[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide20] -max -fall  -source -latency_included 124[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide20] -in -rise -source -latency_included 121[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide20] -in -rise -source -latency_included 121[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide20] -in -rise -source -latency_included 121[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide20] -in -rise -source -latency_included 121[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide20] -in -rise -source -latency_included 121[get_ports scan_enable]
 set_input_delay -clock [get_clocks yet_to_decide21] -min -rise -source -latency_included 122[get_ports scan_mode]
 set_input_delay -clock [get_clocks yet_to_decide21] -min -fall -source -latency_included 123[get_ports scan_mode]
 set_input_delay -clock [get_clocks yet_to_decide21] -max -rise -source -latency_included 124[get_ports scan_mode]
 set_input_delay -clock [get_clocks yet_to_decide21] -max -fall  -source -latency_included 125[get_ports scan_mode]
 set_input_delay -clock [get_clocks yet_to_decide21] -in -rise -source -latency_included 122[get_ports scan_mode]
 set_input_delay -clock [get_clocks yet_to_decide21] -in -rise -source -latency_included 122[get_ports scan_mode]
 set_input_delay -clock [get_clocks yet_to_decide21] -in -rise -source -latency_included 122[get_ports scan_mode]
 set_input_delay -clock [get_clocks yet_to_decide21] -in -rise -source -latency_included 122[get_ports scan_mode]
 set_input_delay -clock [get_clocks yet_to_decide21] -in -rise -source -latency_included 122[get_ports scan_mode]
set_output_Delay_clock [get_clocks yet_to_decide22] -min -rise source_latency_inlcuded 100 [get ports aclk]
set_output_Delay_clock [get_clocks yet_to_decide22] -min -rise source_latency_inlcuded 101 [get ports aclk]
set_output_Delay_clock [get_clocks yet_to_decide22] -min -rise source_latency_inlcuded 102 [get ports aclk]
set_output_Delay_clock [get_clocks yet_to_decide22] -min -rise source_latency_inlcuded 103 [get ports aclk]
set_load 10[get ports aclk]
set_output_Delay_clock [get_clocks yet_to_decide23] -min -rise source_latency_inlcuded 101 [get ports aclk_en]
set_output_Delay_clock [get_clocks yet_to_decide23] -min -rise source_latency_inlcuded 102 [get ports aclk_en]
set_output_Delay_clock [get_clocks yet_to_decide23] -min -rise source_latency_inlcuded 103 [get ports aclk_en]
set_output_Delay_clock [get_clocks yet_to_decide23] -min -rise source_latency_inlcuded 104 [get ports aclk_en]
set_load 11[get ports aclk_en]
set_output_Delay_clock [get_clocks yet_to_decide24] -min -rise source_latency_inlcuded 102 [get ports dbg_freeze]
set_output_Delay_clock [get_clocks yet_to_decide24] -min -rise source_latency_inlcuded 103 [get ports dbg_freeze]
set_output_Delay_clock [get_clocks yet_to_decide24] -min -rise source_latency_inlcuded 104 [get ports dbg_freeze]
set_output_Delay_clock [get_clocks yet_to_decide24] -min -rise source_latency_inlcuded 105 [get ports dbg_freeze]
set_load 12[get ports dbg_freeze]
set_output_Delay_clock [get_clocks yet_to_decide25] -min -rise source_latency_inlcuded 103 [get ports dbg_i2c_sda_out]
set_output_Delay_clock [get_clocks yet_to_decide25] -min -rise source_latency_inlcuded 104 [get ports dbg_i2c_sda_out]
set_output_Delay_clock [get_clocks yet_to_decide25] -min -rise source_latency_inlcuded 105 [get ports dbg_i2c_sda_out]
set_output_Delay_clock [get_clocks yet_to_decide25] -min -rise source_latency_inlcuded 106 [get ports dbg_i2c_sda_out]
set_load 13[get ports dbg_i2c_sda_out]
set_output_Delay_clock [get_clocks yet_to_decide26] -min -rise source_latency_inlcuded 104 [get ports dbg_uart_txd]
set_output_Delay_clock [get_clocks yet_to_decide26] -min -rise source_latency_inlcuded 105 [get ports dbg_uart_txd]
set_output_Delay_clock [get_clocks yet_to_decide26] -min -rise source_latency_inlcuded 106 [get ports dbg_uart_txd]
set_output_Delay_clock [get_clocks yet_to_decide26] -min -rise source_latency_inlcuded 107 [get ports dbg_uart_txd]
set_load 14[get ports dbg_uart_txd]
set_output_Delay_clock [get_clocks yet_to_decide27] -min -rise source_latency_inlcuded 105 [get ports dco_enable]
set_output_Delay_clock [get_clocks yet_to_decide27] -min -rise source_latency_inlcuded 106 [get ports dco_enable]
set_output_Delay_clock [get_clocks yet_to_decide27] -min -rise source_latency_inlcuded 107 [get ports dco_enable]
set_output_Delay_clock [get_clocks yet_to_decide27] -min -rise source_latency_inlcuded 108 [get ports dco_enable]
set_load 15[get ports dco_enable]
set_output_Delay_clock [get_clocks yet_to_decide28] -min -rise source_latency_inlcuded 106 [get ports dco_wkup]
set_output_Delay_clock [get_clocks yet_to_decide28] -min -rise source_latency_inlcuded 107 [get ports dco_wkup]
set_output_Delay_clock [get_clocks yet_to_decide28] -min -rise source_latency_inlcuded 108 [get ports dco_wkup]
set_output_Delay_clock [get_clocks yet_to_decide28] -min -rise source_latency_inlcuded 109 [get ports dco_wkup]
set_load 16[get ports dco_wkup]
set_output_Delay_clock [get_clocks yet_to_decide29] -min -rise source_latency_inlcuded 107 [get ports dmem_addr]
set_output_Delay_clock [get_clocks yet_to_decide29] -min -rise source_latency_inlcuded 108 [get ports dmem_addr]
set_output_Delay_clock [get_clocks yet_to_decide29] -min -rise source_latency_inlcuded 109 [get ports dmem_addr]
set_output_Delay_clock [get_clocks yet_to_decide29] -min -rise source_latency_inlcuded 110 [get ports dmem_addr]
set_load 17[get ports dmem_addr]
set_output_Delay_clock [get_clocks yet_to_decide30] -min -rise source_latency_inlcuded 108 [get ports dmem_cen]
set_output_Delay_clock [get_clocks yet_to_decide30] -min -rise source_latency_inlcuded 109 [get ports dmem_cen]
set_output_Delay_clock [get_clocks yet_to_decide30] -min -rise source_latency_inlcuded 110 [get ports dmem_cen]
set_output_Delay_clock [get_clocks yet_to_decide30] -min -rise source_latency_inlcuded 111 [get ports dmem_cen]
set_load 18[get ports dmem_cen]
set_output_Delay_clock [get_clocks yet_to_decide31] -min -rise source_latency_inlcuded 109 [get ports dmem_din]
set_output_Delay_clock [get_clocks yet_to_decide31] -min -rise source_latency_inlcuded 110 [get ports dmem_din]
set_output_Delay_clock [get_clocks yet_to_decide31] -min -rise source_latency_inlcuded 111 [get ports dmem_din]
set_output_Delay_clock [get_clocks yet_to_decide31] -min -rise source_latency_inlcuded 112 [get ports dmem_din]
set_load 19[get ports dmem_din]
set_output_Delay_clock [get_clocks yet_to_decide32] -min -rise source_latency_inlcuded 110 [get ports dmem_wen]
set_output_Delay_clock [get_clocks yet_to_decide32] -min -rise source_latency_inlcuded 111 [get ports dmem_wen]
set_output_Delay_clock [get_clocks yet_to_decide32] -min -rise source_latency_inlcuded 112 [get ports dmem_wen]
set_output_Delay_clock [get_clocks yet_to_decide32] -min -rise source_latency_inlcuded 113 [get ports dmem_wen]
set_load 20[get ports dmem_wen]
set_output_Delay_clock [get_clocks yet_to_decide33] -min -rise source_latency_inlcuded 111 [get ports irq_acc]
set_output_Delay_clock [get_clocks yet_to_decide33] -min -rise source_latency_inlcuded 112 [get ports irq_acc]
set_output_Delay_clock [get_clocks yet_to_decide33] -min -rise source_latency_inlcuded 113 [get ports irq_acc]
set_output_Delay_clock [get_clocks yet_to_decide33] -min -rise source_latency_inlcuded 114 [get ports irq_acc]
set_load 21[get ports irq_acc]
set_output_Delay_clock [get_clocks yet_to_decide34] -min -rise source_latency_inlcuded 112 [get ports lfxt_enable]
set_output_Delay_clock [get_clocks yet_to_decide34] -min -rise source_latency_inlcuded 113 [get ports lfxt_enable]
set_output_Delay_clock [get_clocks yet_to_decide34] -min -rise source_latency_inlcuded 114 [get ports lfxt_enable]
set_output_Delay_clock [get_clocks yet_to_decide34] -min -rise source_latency_inlcuded 115 [get ports lfxt_enable]
set_load 22[get ports lfxt_enable]
set_output_Delay_clock [get_clocks yet_to_decide35] -min -rise source_latency_inlcuded 113 [get ports lfxt_wkup]
set_output_Delay_clock [get_clocks yet_to_decide35] -min -rise source_latency_inlcuded 114 [get ports lfxt_wkup]
set_output_Delay_clock [get_clocks yet_to_decide35] -min -rise source_latency_inlcuded 115 [get ports lfxt_wkup]
set_output_Delay_clock [get_clocks yet_to_decide35] -min -rise source_latency_inlcuded 116 [get ports lfxt_wkup]
set_load 23[get ports lfxt_wkup]
set_output_Delay_clock [get_clocks yet_to_decide36] -min -rise source_latency_inlcuded 114 [get ports mclk]
set_output_Delay_clock [get_clocks yet_to_decide36] -min -rise source_latency_inlcuded 115 [get ports mclk]
set_output_Delay_clock [get_clocks yet_to_decide36] -min -rise source_latency_inlcuded 116 [get ports mclk]
set_output_Delay_clock [get_clocks yet_to_decide36] -min -rise source_latency_inlcuded 117 [get ports mclk]
set_load 24[get ports mclk]
set_output_Delay_clock [get_clocks yet_to_decide37] -min -rise source_latency_inlcuded 115 [get ports dma_dout]
set_output_Delay_clock [get_clocks yet_to_decide37] -min -rise source_latency_inlcuded 116 [get ports dma_dout]
set_output_Delay_clock [get_clocks yet_to_decide37] -min -rise source_latency_inlcuded 117 [get ports dma_dout]
set_output_Delay_clock [get_clocks yet_to_decide37] -min -rise source_latency_inlcuded 118 [get ports dma_dout]
set_load 25[get ports dma_dout]
set_output_Delay_clock [get_clocks yet_to_decide38] -min -rise source_latency_inlcuded 116 [get ports dma_ready]
set_output_Delay_clock [get_clocks yet_to_decide38] -min -rise source_latency_inlcuded 117 [get ports dma_ready]
set_output_Delay_clock [get_clocks yet_to_decide38] -min -rise source_latency_inlcuded 118 [get ports dma_ready]
set_output_Delay_clock [get_clocks yet_to_decide38] -min -rise source_latency_inlcuded 119 [get ports dma_ready]
set_load 26[get ports dma_ready]
set_output_Delay_clock [get_clocks yet_to_decide39] -min -rise source_latency_inlcuded 117 [get ports dma_resp]
set_output_Delay_clock [get_clocks yet_to_decide39] -min -rise source_latency_inlcuded 118 [get ports dma_resp]
set_output_Delay_clock [get_clocks yet_to_decide39] -min -rise source_latency_inlcuded 119 [get ports dma_resp]
set_output_Delay_clock [get_clocks yet_to_decide39] -min -rise source_latency_inlcuded 120 [get ports dma_resp]
set_load 27[get ports dma_resp]
set_output_Delay_clock [get_clocks yet_to_decide40] -min -rise source_latency_inlcuded 118 [get ports per_addr]
set_output_Delay_clock [get_clocks yet_to_decide40] -min -rise source_latency_inlcuded 119 [get ports per_addr]
set_output_Delay_clock [get_clocks yet_to_decide40] -min -rise source_latency_inlcuded 120 [get ports per_addr]
set_output_Delay_clock [get_clocks yet_to_decide40] -min -rise source_latency_inlcuded 121 [get ports per_addr]
set_load 28[get ports per_addr]
set_output_Delay_clock [get_clocks yet_to_decide41] -min -rise source_latency_inlcuded 119 [get ports per_din]
set_output_Delay_clock [get_clocks yet_to_decide41] -min -rise source_latency_inlcuded 120 [get ports per_din]
set_output_Delay_clock [get_clocks yet_to_decide41] -min -rise source_latency_inlcuded 121 [get ports per_din]
set_output_Delay_clock [get_clocks yet_to_decide41] -min -rise source_latency_inlcuded 122 [get ports per_din]
set_load 29[get ports per_din]
set_output_Delay_clock [get_clocks yet_to_decide42] -min -rise source_latency_inlcuded 120 [get ports per_en]
set_output_Delay_clock [get_clocks yet_to_decide42] -min -rise source_latency_inlcuded 121 [get ports per_en]
set_output_Delay_clock [get_clocks yet_to_decide42] -min -rise source_latency_inlcuded 122 [get ports per_en]
set_output_Delay_clock [get_clocks yet_to_decide42] -min -rise source_latency_inlcuded 123 [get ports per_en]
set_load 30[get ports per_en]
set_output_Delay_clock [get_clocks yet_to_decide43] -min -rise source_latency_inlcuded 121 [get ports per_we]
set_output_Delay_clock [get_clocks yet_to_decide43] -min -rise source_latency_inlcuded 122 [get ports per_we]
set_output_Delay_clock [get_clocks yet_to_decide43] -min -rise source_latency_inlcuded 123 [get ports per_we]
set_output_Delay_clock [get_clocks yet_to_decide43] -min -rise source_latency_inlcuded 124 [get ports per_we]
set_load 31[get ports per_we]
set_output_Delay_clock [get_clocks yet_to_decide44] -min -rise source_latency_inlcuded 122 [get ports pmem_addr]
set_output_Delay_clock [get_clocks yet_to_decide44] -min -rise source_latency_inlcuded 123 [get ports pmem_addr]
set_output_Delay_clock [get_clocks yet_to_decide44] -min -rise source_latency_inlcuded 124 [get ports pmem_addr]
set_output_Delay_clock [get_clocks yet_to_decide44] -min -rise source_latency_inlcuded 125 [get ports pmem_addr]
set_load 32[get ports pmem_addr]
set_output_Delay_clock [get_clocks yet_to_decide45] -min -rise source_latency_inlcuded 123 [get ports pmem_cen]
set_output_Delay_clock [get_clocks yet_to_decide45] -min -rise source_latency_inlcuded 124 [get ports pmem_cen]
set_output_Delay_clock [get_clocks yet_to_decide45] -min -rise source_latency_inlcuded 125 [get ports pmem_cen]
set_output_Delay_clock [get_clocks yet_to_decide45] -min -rise source_latency_inlcuded 126 [get ports pmem_cen]
set_load 33[get ports pmem_cen]
set_output_Delay_clock [get_clocks yet_to_decide46] -min -rise source_latency_inlcuded 124 [get ports pmem_din]
set_output_Delay_clock [get_clocks yet_to_decide46] -min -rise source_latency_inlcuded 125 [get ports pmem_din]
set_output_Delay_clock [get_clocks yet_to_decide46] -min -rise source_latency_inlcuded 126 [get ports pmem_din]
set_output_Delay_clock [get_clocks yet_to_decide46] -min -rise source_latency_inlcuded 127 [get ports pmem_din]
set_load 34[get ports pmem_din]
set_output_Delay_clock [get_clocks yet_to_decide47] -min -rise source_latency_inlcuded 125 [get ports pmem_wen]
set_output_Delay_clock [get_clocks yet_to_decide47] -min -rise source_latency_inlcuded 126 [get ports pmem_wen]
set_output_Delay_clock [get_clocks yet_to_decide47] -min -rise source_latency_inlcuded 127 [get ports pmem_wen]
set_output_Delay_clock [get_clocks yet_to_decide47] -min -rise source_latency_inlcuded 128 [get ports pmem_wen]
set_load 35[get ports pmem_wen]
set_output_Delay_clock [get_clocks yet_to_decide48] -min -rise source_latency_inlcuded 126 [get ports puc_rst]
set_output_Delay_clock [get_clocks yet_to_decide48] -min -rise source_latency_inlcuded 127 [get ports puc_rst]
set_output_Delay_clock [get_clocks yet_to_decide48] -min -rise source_latency_inlcuded 128 [get ports puc_rst]
set_output_Delay_clock [get_clocks yet_to_decide48] -min -rise source_latency_inlcuded 129 [get ports puc_rst]
set_load 36[get ports puc_rst]
set_output_Delay_clock [get_clocks yet_to_decide49] -min -rise source_latency_inlcuded 127 [get ports smclk]
set_output_Delay_clock [get_clocks yet_to_decide49] -min -rise source_latency_inlcuded 128 [get ports smclk]
set_output_Delay_clock [get_clocks yet_to_decide49] -min -rise source_latency_inlcuded 129 [get ports smclk]
set_output_Delay_clock [get_clocks yet_to_decide49] -min -rise source_latency_inlcuded 130 [get ports smclk]
set_load 37[get ports smclk]
set_output_Delay_clock [get_clocks yet_to_decide50] -min -rise source_latency_inlcuded 128 [get ports smclk_en]
set_output_Delay_clock [get_clocks yet_to_decide50] -min -rise source_latency_inlcuded 129 [get ports smclk_en]
set_output_Delay_clock [get_clocks yet_to_decide50] -min -rise source_latency_inlcuded 130 [get ports smclk_en]
set_output_Delay_clock [get_clocks yet_to_decide50] -min -rise source_latency_inlcuded 131 [get ports smclk_en]
set_load 38[get ports smclk_en]